Repository: convissor/login-security-solution
Catalog: languages/login-security-solution-*.po
Languages: fi_fi

source: Settings
fi_fi: Asetukset

source: Change All Passwords
fi_fi: Vaihda kaikki salasanat

source: Do not remind me about this
fi_fi: Älä muistuta minua tästä

source: Require All Passwords Be Changed
fi_fi: Edellytä kaikkien salasanojen vaihtamista

source: %s must be activated via the Network Admin interface when WordPress is in multistie network mode.
fi_fi: %s tulee aktivoida verkkoylläpitäjän rajapinnasta kun Wordpress on monisivustotilassa

source: Idle Timeout
fi_fi: Aikakatkaisu

source: Close inactive sessions after this many minutes. 0 disables this feature.
fi_fi: Sulje passiiviset istunnot. 0 poistaa toiminnon käytöstä.

source: Maintenance Mode
fi_fi: Huoltotila

source: Disable logins from users who are not administrators and disable posting of comments?
fi_fi: Haluatko poistaa kirjautumisen käyttäjiltä jotka eivät ole ylläpitäjiä ja ottaa kommentoinnin pois käytöstä?

source: Off, let all users log in.
fi_fi: Anna kaikkien käyttäjien kirjautua.

source: On, disable comments and only let administrators log in.
fi_fi: Kommentointi pois käytöstä, vain ylläpitäjät voivat kirjautua.

source: Deactivation
fi_fi: Deaktivointi

source: Should deactivating the plugin remove all of the plugin's data and settings?
fi_fi: Haluatko että liitännäisen deaktivointi poistaa kaikki liitännäisen tiedot ja asetukset?

source: No, preserve the data for future use.
fi_fi: Ei, säilytä tiedot tulevaisuutta varten.

source: Yes, delete the damn data.
fi_fi: Kyllä, poista jo ne perkeleen tiedot.

source: Match Time
fi_fi: Täsmää aika

source: How far back, in minutes, should login failures look for matching data? 0 disables Login Failure slow downs, notifications and breach confirmations.
fi_fi: Millä aikavälillä minuuteissa haluat että epäonnistuneissa kirjautumisissa etsitään täsmääviä tietoja?

source: Delay Tier 2
fi_fi: Viivetaso 2

source: How many matching login failures should it take to get into this (%d - %d second) Delay Tier? Must be >= %d.
fi_fi: Kuinka monta epäonnistunutta kirjautumista haluat tälle (%d - %d sekunnin) tälle viivetasolle siirtymiseksi? Vaaditaan >= %d.

source: Delay Tier 3
fi_fi: Viivetaso 3

source: How many matching login failures should it take to get into this (%d - %d second) Delay Tier? Must be > Delay Tier 2.
fi_fi: Kuinka monta epäonnistunutta kirjautumista haluat tälle (%d - %d sekunnin) viivetasolle siirtymiseksi? Vaaditaan > viivetaso 2.

source: DoS Tier
fi_fi: Palvelunestohyökkäystaso

source: How many matching login failures should it take until the plugin stops delaying responses (to avoid a Denial of Service problem)? 0 disables this feature. Must be > Delay Tier 3.
fi_fi: Kuinka monta epäonnistunutta kirjautumista haluat että liitännäinen lopettaa viivytyksen (palvelunesto-ongelman estämiseksi)? 0 poistaa ominaisuuden käytöstä. Vaaditaan > Viivetaso 3.

source: Notifications To
fi_fi: Ilmoitukset

source: The email address(es) the failure and breach notifications should be sent to. For multiple addresses, separate them with commas. WordPress' 'admin_email' setting is used if none is provided here.
fi_fi: Sähköpostiosoitteet joihin rikkomusilmoitukset lähetetään. Jos käytät montaa osoitetta, ole hyvä ja erottele ne pilkulla. Wordpressin ''admin_email'' asetus on käytössä mikäli yhtäkään osoitetta ei olla ilmoitettu.

source: Failure Notification
fi_fi: Epäonnistumisilmoitus

source: Notify the administrator after x matching login failures. 0 disables this feature.
fi_fi: Ilmoita ylläpitäjälle X epäonnistuneen kirjautumisen jälkeen. 0 poistaa ominaisuuden käytöstä.

source: Multiple Failure Notifications
fi_fi: Useita epäonnistumisilmoituksia.

source: Should multiple failure notifications be sent to the administrators?
fi_fi: Haluatko että monta ilmoitus useista epäonnistumisista lähetetään ylläpitäjälle?

source: No, just notify them the first time that x matching login failures happen.
fi_fi: Ei, ilmoita ainoastaan ensimmäisellä kerralla kun X kirjautumista on epäonnistunut.

source: Yes, notify them upon every x matching login failures.
fi_fi: Kyllä, ilmoita joka kerralla kun X kirjautumista on epäonnistunut.

source: Breach Notification
fi_fi: Rikkomusilmoitus

source: Notify the administrator if a successful login uses data matching x login failures. 0 disables this feature.
fi_fi: Ilmoita ylläpitäjälle mikäli onnistunut kirjautuminen käyttää tietoja jotka täsmäävät X epäonnistunutta kirjautumista. 0 poistaa ominaisuuden käytöstä.

source: Breach Email Confirm
fi_fi: Rikkomusilmoituksen vahvistus

source: If a successful login uses data matching x login failures, immediately log the user out and require them to use WordPress' lost password process. 0 disables this feature.
fi_fi: Mikäli onnistunut kirjautuminen käyttää tietoja jotka täsmäävät X epäonnistuneeseen kirjautumiseen, pakota käyttäjä kirjautumaan ulos välittömästi ja nollaamaan salasana Wordpressin hukkunut salasana - prosessilla. 0 poistaa ominaisuuden käytöstä.

source: Length
fi_fi: Pituus

source: How long must passwords be? Must be >= %d.
fi_fi: Mikä on salasanojen vähimmäispituus? Vaaditaan >= %d.

source: Complexity Exemption
fi_fi: Erivapaus monimutkaisuusvaatimuksista

source: How long must passwords be to be exempt from the complexity requirements? Must be >= %d.
fi_fi: Kuinka pitkiä salasanojen tulee olla jotta ne vapautettaisiin monimutkaisuusvaatimuksista? Vaaditaan >= %d.

source: Aging
fi_fi: Vanheneminen

source: How many days old can a password be before requiring it be changed? Not recommended. 0 disables this feature.
fi_fi: Kuinka monta päivää vanha salasanan tulee olla jotta se vaaditaan muutettavaksi? Ei suositella. 0 poistaa ominaisuuden käytöstä.

source: Grace Period
fi_fi: Armonaika

source: How many minutes should a user have to change their password once they know it has expired? Must be >= %d.
fi_fi: Kuinka monta minuuttia käyttäjälle tulee antaa sen jälkeen kun hän tietää että salasana on vanhentunut? Vaaditaan >= %d.

source: History
fi_fi: Historia

source: How many passwords should be remembered? Prevents reuse of old passwords. 0 disables this feature.
fi_fi: Kuinka monta salasanaa muistetaan? Estää vanhojen salasanojen käyttämisen. 0 poistaa ominaisuuden käytöstä.

source: Deletion Interval
fi_fi: Poistamisaikaväli

source: Run the deletion process upon every x login failures. 0 disables this feature. Suggested value: %d.
fi_fi: Suorita poistamisprosessi X epäonnistuneen kirjautumisen jälkeen. 0 poistaa ominaisuuden käytöstä. Suositeltu arvo: %d.

source: Deletion Days
fi_fi: Poistopäivät

source: Delete records older than x days.
fi_fi: Poista tiedot jotka ovat vanhempia kuin X päivää.

source: Login Failure Policies
fi_fi: Menettelytavat koskien epäonnistuneita kirjautumisia

source: Data Retention Policies
fi_fi: Menettelytavat koskien tiedonsäilytystä

source: Password Policies
fi_fi: Menettelytavat koskien salasanoja

source: Miscellaneous Policies
fi_fi: Sekalaiset menettelytavat

source: This plugin stores the IP address, username and password for each failed log in attempt.
fi_fi: Tämä liitännäinen säilyttää IP-osoitteet, käyttäjätunnukset ja salasanat jokaisen epäonnistuneen kirjautumisen jälkeen.

source: The data from future login failures are compared against the historical data.
fi_fi: Tulevien epäonnistuneiden kirjautumisten tietoja verrataan vanhoihin tietoihin.

source: If any of the data points match, the plugin delays printing out the failure message.
fi_fi: Mikäli yksikään tiedoista täsmää, liitännäinen viivyttää epäonnistumisilmoituksen tulostamista.

source: The goal is for the responses to take so long that the attackers give up and go find an easier target.
fi_fi: Tavoitteena on että vastauksen saaminen kestää niin kauan että hyökkääjät antavat periksi.

source: The length of the delay is broken up into three tiers.
fi_fi: Viivytyksen taso on hajautettu kolmelle tasolle.

source: The amount of the delay increases in higher tiers.
fi_fi: Viiveaika lisääntyy korkeammilla tasoilla.

source: The delay time within each tier is randomized to complicate profiling by attackers.
fi_fi: Viiveaika jokaisella tasolla on tehty satunnaiseksi profiloinnin estämiseksi.

source: The means for automatically deleting old records from the %s table.
fi_fi: Tämä tarkoittaa tietojen automaattista poistamista %s taulusta.

source: Default:
fi_fi: Oletusasetus:

source: must be >= '%s',
fi_fi: Vaaditaan >= '%s',

source: so we used the default value instead.
fi_fi: joten käytämme oletusarvoa.

source: must be an integer,
fi_fi: tulee olla kokonaisluku,

source: There may be cases where everyone's password should be reset.
fi_fi: On tapauksia joissa kaikkien salasanat tulee nollata.

source: This page, provided by the %s plugin, offers that functionality.
fi_fi: Tämä liitännäisen %s tarjoama sivu antaa siihen mahdollisuuden.

source: Submitting this form sets a flag that forces all users, except yourself, to utilize WordPress' built in password reset functionality.
fi_fi: Tämän lomakkeen lähettäminen pakottaa kaikki käyttäjät (paitsi itsesi) nollaamaan salasanansa Wordpressin nollaustoiminnolla.

source: Users who are presently logged in will be logged out the next time they view a page that requires authentication.
fi_fi: Käyttäjät jotka ovat tällä hetkellä kirjautuneita kirjataan ulos seuraavan kerran kun he käyttävät sivua joka vaatii tunnistautumisen.

source: Confirm that you want to force all users to change their passwords by checking this box, then click the button, below.
fi_fi: Vahvista että haluat pakottaa kaikki käyttäjät nollaamaan salasanansa merkitsemällä tämän laatikon, ja painamalla allaolevaa nappia.

source: No thanks. I know what I'm doing. Please don't remind me about this.
fi_fi: Ei kiitos, tiedän kyllä mitä olen tekemässä. Ole hyvä äläkä muistuta minua tästä.

source: No thanks
fi_fi: Ei kiitos

source: Success!
fi_fi: Onnistui!

source: Confirm
fi_fi: Vahvista

source: an administrator
fi_fi: ylläpitäjä

source: You do not have sufficient permissions to access this page.
fi_fi: Sinulla ei ole tarvittavia käyttöoikeuksia tälle sivulle.

source: Invalid username or password.
fi_fi: Väärä käyttäjätunnus tai salasana.

source: Password reset is not allowed for this user
fi_fi: Tämä käyttäjä ei voi nollata salasanaa.

source: Please log back in.
fi_fi: Ole hyvä ja kirjaudu takaisin sisään.

source: The grace period for changing your password has expired.
fi_fi: Salasanan nollaamisen armonaika on umpeutunut.

source: Please submit this form to reset your password.
fi_fi: Ole hyvä ja lähetä tämä lomake nollataksesi salasanasi.

source: Your password must be reset.
fi_fi: Sinun tulee nollata salasanasi.

source: Please submit this form to reset it.
fi_fi: Ole hyvä ja lähetä tämä lomake nollataksesi salasanasi.

source: Your password has expired. Please log and change it.
fi_fi: Salasanasi on vanhentunut. Ole hyvä ja vaihda se.

source: The site is undergoing maintenance.
fi_fi: Sivustoa huolletaan tällä hetkellä.

source: Please try again later.
fi_fi: Ole hyvä ja yritä uudelleen myöhemmin.

source: ERROR
fi_fi: VIRHE

source: Passwords must use ASCII characters.
fi_fi: Salasanan tulee käyttää ASCII-merkkejä.
